export default {
  projections: {
    АвПользователиE: {
      датаРегистрации: {
        __caption__: 'Дата регистрации'
      },
      iDПользователя: {
        __caption__: 'ID Пользователя'
      },
      сотрудники: {
        __caption__: 'ФИО Сотрудника',
        фИОСотрудника: {
          __caption__: 'ФИО Сотрудника'
        }
      },
      логин: {
        __caption__: 'Логин'
      },
      пароль: {
        __caption__: 'Пароль'
      },
      тЧПрава: {
        __caption__: 'Права пользователя',
        праваПол: {
          __caption__: 'Права пользователя'
        }
      }
    },
    АвПользователиL: {
      датаРегистрации: {
        __caption__: 'Дата регистрации'
      },
      iDПользователя: {
        __caption__: 'ID Пользователя'
      },
      сотрудники: {
        __caption__: 'ФИО Сотрудника',
        фИОСотрудника: {
          __caption__: 'ФИО Сотрудника'
        }
      },
      логин: {
        __caption__: 'Логин'
      },
      пароль: {
        __caption__: 'Пароль'
      }
    }
  },
  validations: {
    iDПользователя: {
      __caption__: 'ID Пользователя'
    },
    датаРегистрации: {
      __caption__: 'Дата регистрации'
    },
    логин: {
      __caption__: 'Логин'
    },
    пароль: {
      __caption__: 'Пароль'
    },
    сотрудники: {
      __caption__: 'ФИО Сотрудника'
    },
    тЧПрава: {
      __caption__: 'Права пользователя'
    }
  }
};
