export default {
  projections: {
    СотрудникиE: {
      iDСотрудника: {
        __caption__: 'ID Сотрудника'
      },
      фИОСотрудника: {
        __caption__: 'ФИО Сотрудника'
      },
      пол: {
        __caption__: 'Пол'
      },
      номерТелефона: {
        __caption__: 'Номер телефона'
      },
      датаПриема: {
        __caption__: 'Дата приема'
      },
      должности: {
        __caption__: 'Должность',
        должность: {
          __caption__: 'Должность'
        }
      },
      отделы: {
        __caption__: 'Отдел'
      },
      зарплата: {
        __caption__: 'Зарплата'
      }
    },
    СотрудникиL: {
      iDСотрудника: {
        __caption__: 'ID Сотрудника'
      },
      фИОСотрудника: {
        __caption__: 'ФИО Сотрудника'
      },
      пол: {
        __caption__: 'Пол'
      },
      номерТелефона: {
        __caption__: 'Номер телефона'
      },
      датаПриема: {
        __caption__: 'Дата приема'
      },
      должности: {
        __caption__: 'Должность',
        должность: {
          __caption__: 'Должность'
        }
      },
      отделы: {
        __caption__: 'Отдел'
      },
      зарплата: {
        __caption__: 'Зарплата'
      }
    }
  },
  validations: {
    iDСотрудника: {
      __caption__: 'ID Сотрудника'
    },
    датаПриема: {
      __caption__: 'Дата приема'
    },
    зарплата: {
      __caption__: 'Зарплата'
    },
    номерТелефона: {
      __caption__: 'Номер телефона'
    },
    отделы: {
      __caption__: 'Отдел'
    },
    пол: {
      __caption__: 'Пол'
    },
    фИОСотрудника: {
      __caption__: 'ФИО Сотрудника'
    },
    должности: {
      __caption__: 'Должность'
    }
  }
};
